In [2]:
print("19881A05F5 Madhavarao Nishal CSE-C")
import pandas as pd
import numpy as np

19881A05F5 Madhavarao Nishal CSE-C

In [3]:
print("Solution-1")

Solution-1

In [4]:
df=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} )
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [5]:
print("Solution-2")

Solution-2

In [6]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [11]:
label = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df2=pd.DataFrame(exam_data,index=label)
df2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [12]:
print("Solution-3")

Solution-3

In [13]:
df2[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [14]:
print("Solution-4")

Solution-4

In [16]:
interval=pd.DataFrame({"X":[1,2,3,4,5,6]},
index=pd.IntervalIndex.from_breaks([1,2,3,4,5,6,7]))
interval

        X
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4
(5, 6]  5
(6, 7]  6

In [17]:
interval.index

IntervalIndex([(1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7]], dtype='interval[int64, right]')

In [22]:
interval=pd.DataFrame({"X":[1,2,3,4,5,6]},
index=pd.IntervalIndex.from_tuples([(1,2),(2,3),(3,4),(4,5),(5,6),(6,7)]))
interval

        X
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4
(5, 6]  5
(6, 7]  6

In [23]:
interval.index

IntervalIndex([(1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7]], dtype='interval[int64, right]')

In [24]:
interval=pd.DataFrame({"X":[1,2,3,4,5,6]},
index=pd.IntervalIndex.from_arrays([1,2,3,4,5,6],[2,3,4,5,6,7]))
interval

        X
(1, 2]  1
(2, 3]  2
(3, 4]  3
(4, 5]  4
(5, 6]  5
(6, 7]  6

In [25]:
interval.index

IntervalIndex([(1, 2], (2, 3], (3, 4], (4, 5], (5, 6], (6, 7]], dtype='interval[int64, right]')

In [26]:
print("Solution-5")

Solution-5

In [28]:
data=pd.read_csv('data.csv')
data.shape

(5, 5)

In [29]:
data.shape[0],data.shape[1]

(5, 5)

In [30]:
print("columns\n",data.columns)

columns
 Index(['Year', 'WHO region', 'Country Beverage', 'Types ', 'Display Value'], dtype='object')

In [31]:
data

   Year       WHO region       Country Beverage   Types   Display Value
0  1986  Western Pacific                Vietnam     Wine           0.00
1  1986         Americas                Uruguay   Other            0.50
2  1985        Africa              Cte d'Ivoire   Wine             1.62
3  1986        Americas                Colombia    Beer            4.27
4  1987        Americas   Saint Kitts and Nevis    Beer            1.98

In [32]:
print("Solution-6")

Solution-6

In [33]:
arr1=pd.Series([2, 4, 6, 8, 10] )
arr2=pd.Series([1, 3, 5, 7, 10] )

In [34]:
arr1==arr2

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [35]:
arr1<arr2

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [36]:
print("Solution-7")

Solution-7

In [37]:
student1 = pd.DataFrame({
        'sid': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student2 = pd.DataFrame({
        'sid': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [39]:
mergeddata=pd.concat([student1,student2])
mergeddata

  sid              name  marks
0  S1  Danniella Fenton    200
1  S2      Ryder Storey    210
2  S3      Bryce Jensen    190
3  S4         Ed Bernal    222
4  S5       Kwame Morin    199
0  S4  Scarlette Fisher    201
1  S5  Carla Williamson    200
2  S6       Dante Morse    198
3  S7    Kaiser William    219
4  S8   Madeeha Preston    201

In [40]:
print("Solution-8")

Solution-8

In [44]:
l=[1,2,3,4,5]
nplist=np.array(l)
l,nplist

([1, 2, 3, 4, 5], array([1, 2, 3, 4, 5]))

In [45]:
print("Solution-9")

Solution-9

In [46]:
rang=np.arange(2,11).reshape(3,3)
rang

array([[ 2,  3,  4],
       [ 5,  6,  7],
       [ 8,  9, 10]])

In [47]:
print("Solution-10")

Solution-10

In [48]:
randarray=np.random.random((3,3,3))
randarray

array([[[0.1260321 , 0.63266391, 0.14622201],
        [0.01928697, 0.89704172, 0.90036154],
        [0.45732875, 0.14121172, 0.87637483]],

       [[0.01120813, 0.17546849, 0.34649717],
        [0.78237092, 0.59546706, 0.55992561],
        [0.34583282, 0.78672172, 0.56248247]],

       [[0.35343523, 0.81721661, 0.64845333],
        [0.71013216, 0.49072462, 0.68040047],
        [0.19667241, 0.36700237, 0.67794651]]])